'''
     0      特殊标识
            3      车次
            4      始发站
            5      终点站
            6      购票的出发地
            7      购票的目的地
            8      出发时间
            9      达到时间
            10     历时多久 21:37
            12     特殊标识
            13     出发时间
            21     高级软卧
            23     软卧
            24     软座
            26     无座
            28     硬卧
            29     硬座
            30     二等座
            31     一等座
            32     商务座/特等座
            33     动卧
'''

