def didian():
    with open('didian.txt', 'rt', encoding='utf8') as f:
        txt = f.read()
        f.close()
    li = txt.split('@')
    div = {}
    for i in li:
        a = i.split('|')
        div[a[1]] = a[2]
    return div

'''
M,0,1,蒋长浩,1,411522199702245736,17858801972,N

1：座位  '商务座':'9','二等座':'O','一等座':'M'，软卧：4，硬卧：3，硬座或无座：1，高级软卧 ：6，动卧：F 软座：2
2：
3：票种  成人票：1    儿童票：2   残军票：4   学生票：3？
4：名字  
1:
'''
seat={
    '商务座':'9',
    '二等座':'O',
    '一等座':'M',
    '软卧':'4',
    '硬卧':'3',
    '高级软卧':'6',
    '动卧':'F',
    '软座':'2',
    '硬座':'1'
}
